Revit 2024 API
ExternalResourceServerUtils.ServerSupportsAssemblyCodeData Method
 Checks that the server referenced by the given ExternalResourceReference supports AssemblyCodeData.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static bool ServerSupportsAssemblyCodeData(
	ExternalResourceReference extRef
)
Visual Basic
Public Shared Function ServerSupportsAssemblyCodeData ( _
	extRef As ExternalResourceReference _
) As Boolean
Visual C++
public:
static bool ServerSupportsAssemblyCodeData(
	ExternalResourceReference^ extRef
)
Parameters
extRef
Type: Autodesk.Revit.DB.ExternalResourceReference
 The ExternalResourceReference to check.
Return Value
 True if the ExternalResourceReference refers to a server that supports AssemblyCodeData. False otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalResourceServerUtils Class
Autodesk.Revit.DB Namespace